---
kind: other
id: Methods.T:Autodesk.Revit.DB.ConnectorSetIterator
source: html/2651fea7-4cef-b668-0374-c13e92feb688.htm
---
# ConnectorSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.